{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "init_cell": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true,
    "init_cell": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "import neo4j_scripts\n",
    "import scripts.visTreebank\n",
    "from scripts.visTreebank import drawSent, vis_network\n",
    "import pandas as pd\n",
    "import matplotlib as mp\n",
    "import sys\n",
    "import graphAGDT.objects as gagdt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from IPython.display import IFrame, HTML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = Graph(password=\"boston4ever\")\n",
    "conn = \"http://neo4j:boston4ever@localhost:7474/db/data\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Some basics:\n",
    "\n",
    "https://github.com/nicolewhite/neo4j-jupyter/blob/master/hello-world.ipynb"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Run Cypher Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You can run a cypher query simply like this:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>N. of Sentences</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>281065</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[281065]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher {conn}\n",
    "MATCH (n:Token) RETURN count(n) as `N. of Sentences`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Or you can use the Panda's dataframe import functionalities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19140 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "Iliad               8415\n",
       "Odyssey             6723\n",
       "Oedipus Tyrannus     931\n",
       "Electra              929\n",
       "Ajax                 785\n",
       "Antigone             687\n",
       "Trachiniae           669\n",
       "Prova                  1\n",
       "dtype: int64"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = %cypher {conn} MATCH (s:Sentence) \\\n",
    "              RETURN s.work as Work\n",
    "df = res.get_dataframe()\n",
    "df.Work.value_counts()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "By the way, the same data can be obtained with a single Cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Author</th>\n",
       "        <th>Title</th>\n",
       "        <th>Nr. of Sent</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Homer</td>\n",
       "        <td>Iliad</td>\n",
       "        <td>8415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sophocles</td>\n",
       "        <td>Electra</td>\n",
       "        <td>929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Homer</td>\n",
       "        <td>Odyssey</td>\n",
       "        <td>6723</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Neo4j</td>\n",
       "        <td>Prova</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sophocles</td>\n",
       "        <td>Ajax</td>\n",
       "        <td>785</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sophocles</td>\n",
       "        <td>Trachiniae</td>\n",
       "        <td>669</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sophocles</td>\n",
       "        <td>Antigone</td>\n",
       "        <td>687</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sophocles</td>\n",
       "        <td>Oedipus Tyrannus</td>\n",
       "        <td>931</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Homer', 'Iliad', 8415],\n",
       " ['Sophocles', 'Electra', 929],\n",
       " ['Homer', 'Odyssey', 6723],\n",
       " ['Neo4j', 'Prova', 1],\n",
       " ['Sophocles', 'Ajax', 785],\n",
       " ['Sophocles', 'Trachiniae', 669],\n",
       " ['Sophocles', 'Antigone', 687],\n",
       " ['Sophocles', 'Oedipus Tyrannus', 931]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher {conn}\n",
    "MATCH (s:Sentence)\n",
    "RETURN DISTINCT s.author as Author, s.work AS Title, count(*) AS `Nr. of Sent`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Visualize sentences"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The quickest (yet rather unsatisfactory) way to visualize trees is via the vizTreebank script that is placed in the \"scripts\" folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "opt = {\"Sentence\" : \"address\", \"Token\" : \"form\", \"Artificial\" : \"form\"}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-c84768e8-44f0-4228-ad41-65c04e164276.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10f2c0f60>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sentence_address = \"tlg0012.tlg001.perseus-grc1#2277078#0\"\n",
    "drawSent(g,sentence_address, opt, physics=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Scrapbook"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<module 'scripts.visTreebank' from '/Users/fmambrini/Documents/lavoro/Notebooks/Treebanks/scripts/visTreebank.py'>"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import importlib\n",
    "importlib.reload(scripts.visTreebank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n)\n",
    "    WITH n, rand() AS random\n",
    "    ORDER BY random\n",
    "    LIMIT {limit}\n",
    "    OPTIONAL MATCH (n)-[r]->(m)\n",
    "    RETURN n AS source_node,\n",
    "           id(n) AS source_id,\n",
    "           r,\n",
    "           m AS target_node,\n",
    "           id(m) AS target_id\n",
    "    \"\"\"\n",
    "\n",
    "data = g.run(query, limit=4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (s:Sentence)-[*]->(n)-[r]->(m)\n",
    "    WHERE s.address = \"tlg0011.tlg001.perseus-grc2#2898476#0\"\n",
    "    RETURN n AS source_node,\n",
    "           id(n) AS source_id,\n",
    "           r,\n",
    "           m AS target_node,\n",
    "           id(m) AS target_id\n",
    "    \"\"\"\n",
    "data = g.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Hopefully, it's identical!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n)-[r]->(m)\n",
    "    WHERE n.address =~ \"^tlg0011.tlg001.perseus-grc2#2898476#[0-9]+$\"\n",
    "    RETURN n AS source_node,\n",
    "           id(n) AS source_id,\n",
    "           r,\n",
    "           m AS target_node,\n",
    "           id(m) AS target_id\n",
    "    \"\"\"\n",
    "data = g.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for row in data:\n",
    "    source_node = row[0]\n",
    "    source_form = row[0].get(\"form\")\n",
    "    rel = row[2]\n",
    "    target_node = row[3]\n",
    "    target_form = row[3].get(\"form\")\n",
    "    print(\"{}-->{}\".format(source_form,target_form))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "rows = [d for d in data]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "row = rows[4]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "node = row[0]\n",
    "id = row[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "node_label = list(node.labels())[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'form'"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "prop_key = opt.get(node_label)\n",
    "prop_key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/fmambrini/anaconda/lib/python3.4/site-packages/ipykernel/__main__.py:1: DeprecationWarning: Node.properties is deprecated, use dict(node) instead\n",
      "  if __name__ == '__main__':\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"{'animacy': '', 'cid': '36335578', 'pos': 'noun', 'voice': '-', 'ne_type': '', 'isMemberOfApos': 0, 'mood': '-', 'person': '-', 'case': 'nominative', 'original_label': 'SBJ', 'tense': '-', 'head': '3', 'lemma': 'λόγος', 'gender': 'masculine', 'cite': 'urn:cts:greekLit:tlg0011.tlg001:1', 'isMemberOfCoord': 0, 'degree': '-', 'postag': 'n-s---mn-', 'number': 'singular', 'form': 'λόγος', 'address': 'tlg0011.tlg001.perseus-grc2#2898476#1', 'rank': '1'}\""
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "repr(node.properties)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "e.get(\"form\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "sentence_address = \"tlg0011.tlg001.perseus-grc2#2898496#0\"\n",
    "a_components = sentence_address.split(\"#\")\n",
    "reg_address = \"^{}#[0-9]+$\".format(\"#\".join(a_components[:-1]))\n",
    "reg_address #== \"^tlg0011.tlg001.perseus-grc2#2898496#[0-9]+$\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"figure/graph-27ebccc0-9884-4a84-b204-0cc41f332bab.html\") as f:\n",
    "    h = f.read()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "HTML(h)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-f9bd697e-5582-48e5-b2b5-3f7b0ec8e636.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10f26b748>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "drawSent(g,\"prova#1#0\", opt, physics=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 properties set.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher {conn}\n",
    "MATCH (n:Sentence) \n",
    "WHERE n.address STARTS WITH \"tlg0012.tlg001\" \n",
    "SET n.chronology = \"8th BCE\" \n",
    "SET n.meter = \"dactylic hexameter\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  },
  "toc": {
   "nav_menu": {
    "height": "12px",
    "width": "252px"
   },
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": "block",
   "toc_window_display": true
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
