{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In this notebook, I document some of the use cases that I imagine for the gAGDT and where I see possible development opportunity. Some of the use case are readily implemented, but some of them are rather complicated (at least for me)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "At this moment I envisage at least two big classes of use cases, i.e.:\n",
    "* query and visualization/browsing of the results\n",
    "* modifying the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For the purposes of this illustration I will only load some very basic modules: obviously, we need to interface with our graph.db and I'll use `py2neo` to do it. Then, I'll make use of the integration between cypher (Neo4j's query language) and Jupyter Notebook by using the cypher library for jupyter; I will also make use of the integration between Jupyter's cypher library and Python's `pandas`. Finally, I will show how I tried to implement some of the OGM logic (Object-Graph Mapping) of `py2neo` to the gAGDT. The [OGM interface](http://py2neo.org/v3/ogm.html) of `py2neo` offers you the opportunity to binding the graph nodes and entities to Python objects. For this, I have written a small module that can be found in the github repo under:\n",
    "\n",
    "https://github.com/francescomambrini/gAGDT/object.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "from py2neo.ogm import GraphObject, Property, RelatedTo, RelatedFrom, RelatedObjects\n",
    "import graphAGDT.objects as gagdt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "g = Graph(password=\"boston4ever\")\n",
    "conn = \"http://neo4j:boston4ever@localhost:7474/db/data\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Some basic use cases"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Most frequent substantives used as accusative objects of verbs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We want a list of the most used objects of the verbs in the AGDT. The requirements of this query are very easy:\n",
    "* a governing node that has the Part of Speech (POS) \"verb\"\n",
    "* a governed node that:\n",
    "    * is linked to the governing node with the relation `OBJ`\n",
    "    * has case = accusative\n",
    "    * has pos = noun\n",
    "    \n",
    "We want a list with counts. This is very easily implemented in cypher and can be easily satisfied even by using Neo4j browser."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The query looks like this:\n",
    "\n",
    "```cypher\n",
    "MATCH (h:Token)-[r:OBJ]->(d:Token)\n",
    "WHERE d.case = \"accusative\"\n",
    "and h.pos = \"verb\"\n",
    "and d.pos = \"noun\"\n",
    "RETURN h.lemma as `Head`, d.lemma as `Dependent`, count(*) as `Tot` ORDER BY `Tot` DESC\n",
    "```\n",
    "\n",
    "Or even, in a more compat way, using the key:value syntax for node properties:\n",
    "\n",
    "```cypher\n",
    "MATCH (h:Token {pos : \"verb\"})-[r:OBJ]->(d:Token {pos : \"noun\", case : \"accusative\"})\n",
    "RETURN h.lemma as `Head`, d.lemma as `Dependent`, count(*) as `Tot` ORDER by `Tot` DESC\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "(Note that with the `RETURN ... AS` statement we are just specifying a custom column name that we want to use for the result: it can be omitted)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Using the cypher integration in Jupyter this query is run like that:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7965 rows affected.\n"
     ]
    }
   ],
   "source": [
    "res = %cypher {conn} MATCH (h:Token)-[r:OBJ]->(d:Token) \\\n",
    "    WHERE d.case = \"accusative\" \\\n",
    "    and h.pos = \"verb\" \\\n",
    "    and d.pos = \"noun\" \\\n",
    "    RETURN h.lemma as `Head`, d.lemma as `Dependent`, count(*) as `Tot` ORDER BY `Tot` DESC \\"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "(Here we are saving the results to a python variable that we can reuse in our code).\n",
    "\n",
    "One thing I *love* about using cypher from Jupyter is that you can immediately load the result of your query to a `pandas` DataFrame and then do all sort of data analysis that is supported by this more than awesome library. It is a easy as that: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "df = res.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Head</th>\n",
       "      <th>Dependent</th>\n",
       "      <th>Tot</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>προσαυδάω</td>\n",
       "      <td>ἔπος</td>\n",
       "      <td>113</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>εἶπον</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>φημί</td>\n",
       "      <td>ἔπος</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>χέω</td>\n",
       "      <td>δάκρυον</td>\n",
       "      <td>41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>πάσχω</td>\n",
       "      <td>ἄλγος</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Head Dependent  Tot\n",
       "0  προσαυδάω      ἔπος  113\n",
       "1      εἶπον     μῦθος   70\n",
       "2       φημί      ἔπος   48\n",
       "3        χέω   δάκρυον   41\n",
       "4      πάσχω     ἄλγος   32"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "(Notice how the aliases we used in the `RETURN... AS...` statement of the query are now the column names of our DF. By default cypher would have returned the dotted name variable.property requested, e.g. `h.lemma`. Not as cool and, more importantly, not as handy for operations over DataFrame as what we have here...)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Say we want to chart the most frequently used objects of the verb \"φημί\". We re-write our query and we make use of `pandas` dataframe plotting methods. (Obviously, if we want more control over our plot, we can always import `matplotlib` or `seaborn` and use them with our dataframe)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "q = '''MATCH (h:Token {pos : \"verb\", lemma : \"φημί\"})-[r:OBJ]->(d:Token {pos : \"noun\", case : \"accusative\"})\n",
    "RETURN h.lemma as `Head`, d.lemma as `Dependent`, count(*) as `Tot` ORDER by `Tot` DESC\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 rows affected.\n"
     ]
    }
   ],
   "source": [
    "res = %cypher {conn} {q}\n",
    "df = res.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Head</th>\n",
       "      <th>Dependent</th>\n",
       "      <th>Tot</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>φημί</td>\n",
       "      <td>ἔπος</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>φημί</td>\n",
       "      <td>Πρίαμος</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>φημί</td>\n",
       "      <td>ἀγγελία</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μάχη</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>φημί</td>\n",
       "      <td>φήμη</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Head Dependent  Tot\n",
       "0  φημί      ἔπος   48\n",
       "1  φημί     μῦθος   11\n",
       "2  φημί   Πρίαμος    1\n",
       "3  φημί   ἀγγελία    1\n",
       "4  φημί      μάχη    1\n",
       "5  φημί      φήμη    1"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAsMAAAGbCAYAAAAhuZ1FAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAH7BJREFUeJzt3XmYZVdZLvD3IwFR5kDbRKaWS4iCCkpEREUECRGUoCAo\nog2iuQ5wcSbggDhGUS6gOAThEkFkULiJomKIICpcpFERQoAECGoY0oBMIkHgu3/sE9MpurpOp4Zd\nJ+v3e55+6px1dqXf59npqvfss/Za1d0BAIARXWPuAAAAMBdlGACAYSnDAAAMSxkGAGBYyjAAAMNS\nhgEAGJYyDADAsJRhAACGdewyB1XVxUk+kuRTST7Z3SdV1XFJnp9kX5KLkzyou/99e2ICAMDWq2V2\noFuU4ZO6+32HjP1qkg909xlVdXqSG3X3Y47037nJTW7S+/bt21xiAADYwOte97r3dfeejY5b6srw\nOk5NcvfF47OSvCLJEcvwvn37cuDAgU38lQAAsLGqeucyxy07Z7iTvKyqXldVpy3G9nb3uxeP35Nk\n71FmBACAWS17Zfiru/uSqvrcJOdW1ZsPfbG7u6oOO99iUZ5PS5Jb3vKWmwoLAABbaakrw919yeLr\npUlenOTOSd5bVccnyeLrpet875ndfVJ3n7Rnz4bTNgAAYMdsWIar6jpVdb3LHyc5Ockbk5yTZP/i\nsP1Jzt6ukAAAsB2WmSaxN8mLq+ry45/b3X9RVa9N8oKqekSSdyZ50PbFBACArbdhGe7utye5w2HG\n35/kntsRCgAAdoId6AAAGJYyDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDWmYH\nupW17/SXzB1hW118xn3njgAAsNJcGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACA\nYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMow\nAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCw\nlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADAsZRgA\ngGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhLV2Gq+qYqvrHqvrT\nxfPjqurcqrpw8fVG2xcTAAC23tFcGX50kgsOeX56kvO6+4Qk5y2eAwDAyliqDFfVzZPcN8nvHTJ8\napKzFo/PSnL/rY0GAADba9krw09O8hNJPn3I2N7ufvfi8XuS7N3KYAAAsN02LMNV9Y1JLu3u1613\nTHd3kl7n+0+rqgNVdeDgwYNXPSkAAGyxZa4Mf1WS+1XVxUmel+QeVfWcJO+tquOTZPH10sN9c3ef\n2d0ndfdJe/bs2aLYAACweRuW4e5+bHffvLv3Jfm2JH/V3Q9Nck6S/YvD9ic5e9tSAgDANtjMOsNn\nJLlXVV2Y5OsXzwEAYGUcezQHd/crkrxi8fj9Se659ZEAAGBn2IEOAIBhKcMAAAxLGQYAYFjKMAAA\nw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRh\nAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBh\nKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAA\nAMNShgEAGJYyDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCU\nYQAAhqUMAwAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMKwNy3BV\nXbuq/r6qXl9V51fVExbjx1XVuVV14eLrjbY/LgAAbJ1lrgxfluQe3X2HJHdMckpV3SXJ6UnO6+4T\nkpy3eA4AACtjwzLck48unl5z8aeTnJrkrMX4WUnuvy0JAQBgmyw1Z7iqjqmqf0pyaZJzu/s1SfZ2\n97sXh7wnyd51vve0qjpQVQcOHjy4JaEBAGArLFWGu/tT3X3HJDdPcueq+qI1r3emq8WH+94zu/uk\n7j5pz549mw4MAABb5ahWk+juDyZ5eZJTkry3qo5PksXXS7c+HgAAbJ9lVpPYU1U3XDz+7CT3SvLm\nJOck2b84bH+Ss7crJAAAbIdjlzjm+CRnVdUxmcrzC7r7T6vq1UleUFWPSPLOJA/axpwAALDlNizD\n3f3PSb70MOPvT3LP7QgFAAA7wQ50AAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADAs\nZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhKcMAAAxLGQYA\nYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYy\nDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAw\nLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkG\nAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADCsDctwVd2iql5eVW+qqvOr6tGL8eOq6tyqunDx\n9UbbHxcAALbOMleGP5nkR7v7dknukuQHq+p2SU5Pcl53n5DkvMVzAABYGRuW4e5+d3f/w+LxR5Jc\nkORmSU5NctbisLOS3H+7QgIAwHY4qjnDVbUvyZcmeU2Svd397sVL70myd0uTAQDANlu6DFfVdZP8\ncZIf6u4PH/pad3eSXuf7TquqA1V14ODBg5sKCwAAW2mpMlxV18xUhP+gu1+0GH5vVR2/eP34JJce\n7nu7+8zuPqm7T9qzZ89WZAYAgC2xzGoSleQZSS7o7icd8tI5SfYvHu9PcvbWxwMAgO1z7BLHfFWS\n70zyhqr6p8XY45KckeQFVfWIJO9M8qDtiQgAANtjwzLc3X+bpNZ5+Z5bGwcAAHaOHegAABiWMgwA\nwLCUYQAAhqUMAwAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxl\nGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBg\nWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KGAQAYljIM\nAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACGpQwDADAs\nZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhHTt3ADicfae/\nZO4I2+riM+47dwQAIK4MAwAwMGUYAIBhbViGq+qZVXVpVb3xkLHjqurcqrpw8fVG2xsTAAC23jJX\nhp+V5JQ1Y6cnOa+7T0hy3uI5AACslA3LcHe/MskH1gyfmuSsxeOzktx/i3MBAMC2u6pzhvd297sX\nj9+TZO8W5QEAgB2z6RvouruT9HqvV9VpVXWgqg4cPHhws38dAABsmataht9bVccnyeLrpesd2N1n\ndvdJ3X3Snj17ruJfBwAAW++qluFzkuxfPN6f5OytiQMAADtnmaXV/jDJq5OcWFX/VlWPSHJGkntV\n1YVJvn7xHAAAVsqG2zF397ev89I9tzgLAADsKDvQAQAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAw1KG\nAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNShgEAGJYyDADAsJRhAACG\npQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAAhqUMAwAwLGUYAIBhKcMA\nAAxLGQYAYFjKMAAAw1KGAQAYljIMAMCwlGEAAIalDAMAMCxlGACAYSnDAAAMSxkGAGBYyjAAAMNS\nhgEAGJYyDADAsJRhAACGpQwDADAsZRgAgGEpwwAADEsZBgBgWMowAADDUoYBABiWMgwAwLCUYQAA\nhqUMAwAwLGUYAIBhKcMAAAxLGQYAYFjKMAAAwzp27gDA1c++018yd4RtdfEZ9507wra6Op8/5261\nOX+rbbeeP1eGAQAYljIMAMCwNlWGq+qUqnpLVV1UVadvVSgAANgJV7kMV9UxSZ6W5BuS3C7Jt1fV\n7bYqGAAAbLfNXBm+c5KLuvvt3f2JJM9LcurWxAIAgO1X3X3VvrHqgUlO6e7vWTz/ziRf0d2PXHPc\naUlOWzw9MclbrnrcXe8mSd43dwiuEudutTl/q835W13O3Wq7up+/W3X3no0O2val1br7zCRnbvff\nsxtU1YHuPmnuHBw95261OX+rzflbXc7danP+JpuZJnFJklsc8vzmizEAAFgJmynDr01yQlV9flVd\nK8m3JTlna2IBAMD2u8rTJLr7k1X1yCQvTXJMkmd29/lblmw1DTEd5GrKuVttzt9qc/5Wl3O32py/\nbOIGOgAAWHV2oAMAYFjKMAAAw1KGAQAYljIMAMCwlOFNqKobVNVxc+cAWCVVdcMjvPZDO5kFwGoS\nm1BVL0nyZ939tMO8dr8kv5rkP5P8YHe/aqfzAexGVfXxJK9I8kdJzu7ug4vxeyX5/e4+fsZ4cLVV\nVddI8rAk90yyN0e4KNrd99ihWLNThjehqt6X5G7d/aY149dI8oEkv5Xk+knu2d1fOENEjqCqXpjk\ndd19xmFeu0uSn830Zuax3f3mHY7HBpy/1VVVN0vyhCQPT/LpJG9Jcsskn0jyw9397BnjsYGquk6S\nx2S5QnXrncrFxqrqyUl+IMnLkrwrybolsLu/d6dyze0qb7pBkuQ6mX6Qr3WbJJ/V3Y+rqs/J9AOD\n3eduSX5+nddenOS8JJ+T5NlJvnynQrE05291nZpkf6Zz9PdJDia5f5I7ZXoDw+7220num+T52aBQ\nset8e5KHdPcfzR1kN1GGN+f8JN+S5JfWjD8gyQVJ0t0fS/InO5yL5dwgycfWDlbV5yc5rrsfWlU3\nSPLQHU/GMpy/1XV6kv3d/dxDxp5SVfdI8geZpk+we903yYO7+2VzB+GoHZvkH+cOsdsow5vzxCTP\nrqq9Sc7N9O74Xkm+P8l3zxmMpbwt0/m6aM34vRevpbs/lOQz5oSzKzh/q+smSf7hMOMvT3LNHc7C\n0ftEkn+ZOwRXybMzXbD71bmD7CbK8CZ09/MX0yB+NsmjFsOXJHlkd//BbMFY1m8l+ZWqunau/Gbm\nCUkeP2cwluL8ra6/SvLkqnpkd1+UJFV1vUzTXi6YNRnLeFqS/5nkR+cOwlH7UJLHVNVdk/xTpjc2\n/627137SPQQ30G2RqtqTJJffFc1qqKonJPnxJJ+VpJJcluRJ3f2TswZjKc7faqqqW2W6CnyrTDcb\nfzzTjVj/muSbu/ufZ4zHBqrq6ZmuLr4zyevzmYXqtDlysbGqescRXu5Rb3hUhrdAVd0iye0WT9/Y\n3ZfMmYejs7i6f/vF0zd193/MmYej4/ytpqr6rCT3SXLbTGX4oiQv7e5PzhqMDVXVy4/wco+0JBdX\nD8rwJix+Cf92pht0ajH86STPSfL93e2u6BVQVccm+R+Lp2/zy3i1OH+7X1XdIck/9wa/cKrqWklO\n6e5zdiYZkCRV9blJ7tPdz5o7yxyU4U2oqqcl+cZM84X/ejF89yRPTfIn3f3ImaKxhMV60I9P8mNJ\nrr0Y/s8kv5bk57r7cMvmsUs4f6ujqn48yV2TfFt3X3aE4/YleXN3X3u9Y5hfVX1bdz9vg2NunORX\nu/sROxSLJVTVz6zz0gmZpihddyfz7BbK8CZU1XuTfFd3v3TN+ClJzuruvfMkYxlV9fNJfjDTDZCH\nvpl5fJLf7O71fmiwCzh/q6Oqjsm0+s6Xd/fXVNXjDnPYNZN8XaY12r9yRwNyVKrqk5lWA/mJ7n7F\nOsc8PMkTu/smO5mNI6uqC9cMHZPk+CTXSvKz3b3e2u1Xa8rwJiy2FP2S7n7rmvETk/xTd3/2PMlY\nRlX9a5If6e4Xrhl/UJJf7+5bzJOMZTh/q6eqHtTdL1jnJp6PJnljkp++fIUJdqequmOSX8m0esuf\nJXlMd5+/eO3kJI/IdIPdr3X36bMFZSmHTPm8bNSbH5XhTaiqA0le0d0/tmb8SUm+prvterWLVdVl\nSW6/9hdvVZ2Q5A0+qt3dnD+YV1V9fZIzktwhyUuSfGmSGyV5UZJndvcrZ4zHUaiqL0hyYNRpEtYZ\n3pyfSXJ2VX11ksv/0d8tyZclud9sqVjWRZl2EFy7+Pi3ZLFpA7ua83c1U1U3zLRV7G/NnYUjW1xN\nvFmmXSCPSfJVSW6c5HeTPLa7PzhjPI7e9TItczgkV4Y3qaq+JNMNPJcv7XR+pnlSb5gvFcuoqv1J\nnpHkhUn+ZjF8t0wf7313dz97rmxszPm7eljMJ/6GJPuTfFOSj3T3nnlTcSRV9eBMpfdDmXY0e1am\nNYd/IMlPZirHv5zkN450wyQ7b7HZxlo3zXTeXprkTy8f7O5X7VSuuSnDDK2q7pvkMbnym5lf7u4/\nny8Vy3L+VtdiubX9SR6S5LhMv4ifleSc7v6vGaOxgcWc7xckOX3tcnmLnQRPT/LoJO/r7n07n5D1\nVNWnM+3WWRsc2t19zA5E2hWU4U2oqr/KtBTJh9aM3zbT3Jvrz5MMYPdZ7NT5HZlK8JdkevNyVpLn\ndPd758zG8qrqbUm+trv/7QjHfF6m1QmGvCFrt1rs/riU7n7ndmbZTZThTVi8w3pHkk+teekmme7K\nPH7nU7GMxdWLr820WcN1kvxHkguTvLK7PzpnNjZncSPIU7v75LmzcIWqelSm5dU+mORAkpMzze1+\nYpJnuxoMzEUZ3oRFGf71TEsCXa6TfCTTtqJvmiUY66qqSvJzSX4000YNl2Z68/K+JDfM9MbmiUme\nsNFuWcxr8VHt4c7RjTO9Gf3cHY7EEVTVwUzLNz2huz9VVTdP8sNJvifTm9GnJPnt7v7wjDFZQlX9\nWpIXdvdr1oxXkne5ELS7VdUNktw5yd4k11jvuO7+/R0LNTNleBMWZfim3X3p3FlYTlX9QpKHZ7rp\n8c+7+4NV9ZFMSwO9I8k9k/xGph/0Nm3YxarqJ9cMHZPkNkkemOSh3f2inU/Feqrq7Unu3N3vWzN+\n/STfl2knz+snObO7f3yGiCypqp6e5NQkl2VaRu1vkuzLtIrSp7r76+ZLx6EWm4C9+vLpnFV1nyTP\nzfRvbe2n2ofq7r7WDkTcFZThTViU4b3dfXDuLCynqt6daUvYvz5k7CNJ7tDdb188/8okL+7um84U\nk02oqocm+eHuvtPcWVheVR2b6Wa6H+nuO86dhytU1UOS/N3lc0gX84GflqkQfyrJhzOtL/wvSe7a\n3e+aKytXVlXfm+SRSU7u7vdW1ZuS/L9MNz+6kLdgneHNe1JV/efhXnDjwK503SQb3ajzgSSfswNZ\n2B5/l+T35g7B0enuTyb5/cUfdpePJ3llVd1nsdPcszL1h69O8rruvqyqvjbT8lzPTHLKbEm5ku5+\n+mL77POSfFGmK/jfpAhfmTK8ebdO8om5Q7C0P0/yG1W1f83Vi06SqrpWkl9YHMdq+qokfzt3CNZX\nVZ+f5MPd/f4141+T5Abd/aeH/07m0N0vqqp/T/LHSb4gyV2TfFl3v/WQY/66ql6d5JKZYrKO7v4/\nVfW6xdPXZuotNiY6hGkSm1BVL8+0tJqddlZEVd0kydlJviLJPyZ5S5JvTXJOkmsl+cokFyT5lrW/\nqNldqurMwwzfNMm9M20N+99zU31Ks7ssfjE/rrtfumb85CRP6u4vmicZR1JVN+vuS6rq4ky7zP3h\nmtdPTPIKN9DtXosttJ+Y5GeTvD5rLuaNOsVFGT4KVfXY7v7lQ55/c5K3Lj42OvS4Byc5obt/Yacz\nspyqunempZ1ukyuWVrsoyV9097lzZmM5izejy+juvse2huGoVNWHM83Tf0dV/UuSr+nud1bVviTn\nd/d1Zg3IEVXVIzOtpPTCJK/ONI3ixCQPy3QD5E/Nl44jWdzrdLlDC2BlsI02DqUMH4Wq+tskFyd5\neHf/V1W9JcnDuvvVVXX7JG/p7k9W1V2SPM/OOwCfqar+I9P8xYszrUjwZd39xsUa0a/q7uPmzMfG\nquq0TNsvn5ipDF+U5He6+xmzBuOIFnO713XozeUjWXd9OQ7r7kneleTJi+e3SHL5DjyvTnLLxeNL\nMn1cyy5Wk4dU1ZlV9QdV9YtV9eVz52Lzquor5s7AEb0p03Jqp2XahOOBi/GHJXnjTJk4Ct19Znff\nsbs/u7tv1N1fnuRVVfWXc2djfYuye0Gm5UQfkOkT0s/LtFrIkEU4cWX4qFTV6ZmuYvzD4maBf09y\nt0zviD+a5C7d/dpFoTrHvKndp6rul+Rl3f2xqjo/08Ybf794+XZJvjjTTSLf2d0fnykmS1jMO31h\nkj/u7gsPGb9xkjd1997ZwnFEi2lKL0ry6STfnOQ3k+zJNGXp1LVzidldbHizuqrqTklelmld9rdm\nuih6m0wbUN23u98yY7zZKMNHYbEe7W9m2jHpZkn+b6b/kd6d5I6ZNm14fJJfyvQD4YHr/KeYSVX9\n7yR36u67VdXDuvtZa16/Y5LnJDm3u394jowsZ7H26UOSfEOS85O8MtOyQV+d5Dnd/cj50rGRxcot\nxy7emN4wyT2SvOHQNzbsTja8WV1V9dokr0nymO7+j8XY9TMtaXjD7r77jPFmowwfhcVc4H9McqdM\ny5PcIlesZ/qwTDcUPCDTPLh7+6G++1TV3ZI8sbvX/Ri9qk5K8meubuxui3P5/ExrR78+ycFMOwh+\nIMkp3f3mGeNxBFX1eaPetX51ZsOb3a+qPphpW/Q3rHnplplWmHh4ppvp0t3P3dFwM1KGt1hVHdfd\nH5g7B4e3WBJo/5HmRi1K1h8pw7tbVb0+08d9j+3uTyzGPifJY5I8uLu/YM58rK+q/ivJn2RaeeAv\n5s7D1lisH31Bd1977iwcXlU9OslPZZrSciRDrSxh040tpgjvehdmmspyj3XWqb1ephsKztrRVFwV\nt03ygMuLcJJ098eSPL6qfnC+WCzhmzLdPHdOVV2S5OlJntnd75k3Fptkw5vd7/pJ7tbdFxw6uLgI\n9OLu3qgkXy25Msxwquq23f3WqnpFrnwTSGf6iP3cJE/v7k8f7vvZHRY30P1lps0b+pDxByT5pe4+\ncbZwLKWqjk/yvUkekeT4LK4W55CPcE2n2H1seLO6FufuPpkuCv1dpikRd0nyc5nK8P+aMd5slGFY\no6q+MMlTuvvkubOwvqq6R5I/y3QX9GtyxcL/X5rkO7r7BTPG4yhU1TWS/PTiT10+nME+ql0VNrxZ\nXVV13SRPTfJdmf6NVaZd6H4z04WFTxzh26+2lGGGZXmg1VdVX5xpdZfb5oqF/5/e3W+dNRhLqapb\nJ/mOTKuCnJDpI/Y/TPLfNz+OvPYpbJequl6SWyf5VJK3dfd/zhxpVsoww6qqn8qVy7DlgXaxqrph\nd39wyWOv390f3u5MXDVVdddMq+/cOcmBJM9L8nxTIoA5KMOwhuWBdqeq+ukkH+vuX9/guM9L8i/d\n7QbhXaqq3plpXejHd/fb584DjM0vC/hMf5cr1o9m93hGkj+qquO7+8cWVxfXumamlQou3tFkHK3z\nkvzIslf6AbaTMgyfyfJAu1B3v6uq7p7kyYuhv800zaXWHPqeTPOI2b3eHL9/gF3CNAmGZXmg1VZV\ntzrM8Ee7+/07HoajUlX/mmRPkrOT/E53L7s6AcCWU4YZluWBYB6LpdQu33jj3knenml94Wd19/uO\n9L0AW00ZBlZWVX1Tkh9LcvvF0JuS/Fp3nzNfKo5GVe3LtPHGw5Mcl+TFufKmG780SzBgGMowsJKq\n6lFJnpTkBZluekym+d7fmuTHu/spc2Xj6FTVVyR5WKZS/F+Z5n0n06cyt54rFzAGZRhYSYt5p0/s\n7qeuGX9UktO7+2bzJGMZVXVirthw45aZVph4fpIXWSMa2EnKMLCSquqyJLfv7ovWjN8myeu7+zrz\nJGMjVfWLSR6T5FWZdpx7obnCwFwsbQOsqouTnJxpC+ZD3TvJX+54Go7GDyX51u5+8dxBAFwZBlZS\nVd0v03zh5yd59WL4Lkm+McnP5cpL4z13xwOyrqr6xiR/0d2fPMxrz+/uB88QCxiUMgysrKo6OdPH\n7XfItBLB4XR3H7NzqdhIVb0tyY0yrTP8wkxbM+9L8sAkD+3u28yXDhiNMgzAjqqqY5L8bpLvzrSL\n4OX+NckDu/vALMGAIZkzDKyUqnrIEod1d//htodhaVV180w7BH4wyVOT3CfJTyX5+yQHk9w/yfdl\n2oxDGQZ2jCvDwEqpqk8vcZipEbtMVX0k082Or8m0FvR9uvs1a445Psk/d/eeGSICg7rG3AEAroKb\ndvc1jvBHEd59npLpavD7F8/rMMd8NH4vATvMlWFgpSyuDN+0uy+dOwtXTVX9VqZi/AuZVgL5eJIT\nkzwuybu6+0EzxgMGY84wADvtR5LcMMnv5IorxJ1pqbxHzRUKGJMrw8BKcWX46qOqjktyQpLLkryj\nuz80cyRgQMowsFKq6lOZyvDBubMAsPqUYWClLK4MvzLJJ450XHefvDOJAFhl5gwDq+asuQMAcPXh\nyjAAAMOyniMAAMNShgEAGJYyDADAsJRhAACGpQwDADCs/w+KVPU8X7WVRgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x11542be48>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from matplotlib import pyplot as plt\n",
    "\n",
    "ax = df.Tot.plot(kind=\"bar\", figsize=(12,6))\n",
    "\n",
    "# unfortunately, it's not very easy to set custom xtick labels from within\n",
    "# the plotting function of a DataFrame. Use `pyplot`, change the index of the df\n",
    "# or alternatively use the following code\n",
    "ax.set_xticklabels(df.Dependent, rotation=90, fontsize=\"x-large\")\n",
    "ax.plot()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Retrieve your results in a digital edition"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "With queries such as those that we used in the previous section, it is very easy to know exactly where in the text each of our matching nodes is found. It is sufficient to expand the previous query to have cypher return the `cts urn` of either the governing or the governed word. Luckily, thanks to a great design choice of the AGDT, this information is available. It is then very trivial to get a link from our result to Perseus to read our matching pattern in context."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# notice we're adding the h.cite in the return statement, \n",
    "# i.e the cts urn of the line where the governing verb is found\n",
    "q = '''MATCH (h:Token {pos : \"verb\", lemma : \"φημί\"})-[r:OBJ]->(d:Token {pos : \"noun\", case : \"accusative\", lemma : 'μῦθος'})\n",
    "RETURN h.lemma as `Head`, d.lemma as `Dependent`, h.cite as `Reference`'''\n",
    "\n",
    "res = %cypher {conn} {q}\n",
    "df = res.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Head</th>\n",
       "      <th>Dependent</th>\n",
       "      <th>Reference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg001:21.393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg001:21.471</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg001:23.491</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg001:24.598</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:13.37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:15.171</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:2.384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:20.326</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:21.67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:6.148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>φημί</td>\n",
       "      <td>μῦθος</td>\n",
       "      <td>urn:cts:greekLit:tlg0012.tlg002:8.10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Head Dependent                               Reference\n",
       "0   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg001:21.393\n",
       "1   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg001:21.471\n",
       "2   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg001:23.491\n",
       "3   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg001:24.598\n",
       "4   φημί     μῦθος   urn:cts:greekLit:tlg0012.tlg002:13.37\n",
       "5   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg002:15.171\n",
       "6   φημί     μῦθος   urn:cts:greekLit:tlg0012.tlg002:2.384\n",
       "7   φημί     μῦθος  urn:cts:greekLit:tlg0012.tlg002:20.326\n",
       "8   φημί     μῦθος   urn:cts:greekLit:tlg0012.tlg002:21.67\n",
       "9   φημί     μῦθος   urn:cts:greekLit:tlg0012.tlg002:6.148\n",
       "10  φημί     μῦθος    urn:cts:greekLit:tlg0012.tlg002:8.10"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You can pass each of those URN's as a parameter to a request to Perseus like this:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.perseus.tufts.edu/hopper/text?doc=urn:cts:greekLit:tlg0012.tlg001:21.393\n"
     ]
    }
   ],
   "source": [
    "urn = df.Reference[0]\n",
    "print(\"http://www.perseus.tufts.edu/hopper/text?doc={}\".format(u))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "With a bit of [`MyCapitain`](http://mycapytain.readthedocs.io/en/latest/) it would be possible to do much more sophisticated and appropriate stuff to retrieve the exact passage you're interested in (with, for instance, a given window of lines before and after the passage). That needs not concern us here."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Visualize the results (in a meaningful way)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Say you want to visualize the 11 sentences where φημί governs μῦθος as object. This is unfortunately something I **cannot** do at the moment with the technologies and the code I have at hand. This doesn't sound to difficult to implement, but it's a lot of work and (most likely) it involves the use of languages (such as JavaScript) or libraries that I do not master at all!\n",
    "\n",
    "Anyway, before we start coding we must be clear on the requirements! So here we go..."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "If you use the Neo4j browser and you visualize the results as a graph here is what the query above returns:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![graph](img/graph.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "Cute, but this is definitely **NOT** what any user of a treebank would ever want!\n",
    "\n",
    "The reason is that there is a crucial difference between an ordinary graph and a tree-*bank*. A treebank is a collection of peculiar graphs, i.e. the trees. Each sentence is a graph (a tree) on its own term. When we import a treebank in a graph db we're creating an \"archipelago\" of scattered islands-graphs, the sentences, that are not connected one to each other.\n",
    "\n",
    "Maybe there is a better model for adapting a treebank to a graph db, but I haven't found it..."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "A consequence of this mismatch is that, whenever you're talking about visualizing the result of the query, you're actually talking about visualizing the relations within the matching nodes **within the context of each sentence** where those matches are found.\n",
    "\n",
    "In other words, for the 11 matches above, what a user of a treebank expects is a series of 11 pages / 11 images displaying 11 sentences; each of the couples above are then marked wherever they appear in the sentence.\n",
    "\n",
    "**This** is a closer representation of what a user would expect to see for each of the results (the image is relative to the result n. 4 in the DataFrame, *Od.* 13.37):"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "![screenshot](img/arethusa_screen.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "Or even better, try to run this query on the online PML-TreeQuery that is made available by the Prague Dependency Treebank team and incorporate a conversion of the AGDT for a project named [HamleDT](https://ufal.mff.cuni.cz/hamledt). Go to the link below and click on \"execute query\"\n",
    "\n",
    "http://hdl.handle.net/11346/PMLTQ-ML84"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Copy-paste the following query in the textbox if something is wrong with the link above:\n",
    "\n",
    "```perl\n",
    "a-node $a :=  [\n",
    "  lemma ~ 'φημ.',\n",
    "  a-node [\n",
    "    lemma ~ 'μ.+θος',\n",
    "    afun = 'Obj',\n",
    "  ]\n",
    "];\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "This is a great way of visualizing the query result. Here's a list of the key features that make this visualization great (with some additional requirements expressed as \"it would be great if...\"):\n",
    "\n",
    "* you have a linear representation of the sentence and the tree side by side\n",
    "* the visualization is interactive: if you click on a node or a word:\n",
    "    * the corresponding node/word in the other visualization (sentence or tree) is highlighted\n",
    "    * it would be great if, by hovering/clicking on a node, I could visualize some additional properties of the node that are not shown in the tree (e.g. lemma)\n",
    "* The nodes I have requested in my queries (verb φημί and object μῦθος) are higlighted with different colors\n",
    "* I have a pagination of the 11 results\n",
    "* It would be great if I could export the tree (with the highlighted nodes) as an img, even better a vectorial image (SVG, PDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note that in cypher we will have to modify the query slightly if we want to obtain all the information we need to generate this visualization. Every time a user formulate a query that asks to retrieve all head-nodes governing a dependent via an OBJ relation and specify some property (e.g. the lemma) of node `d` and `h`, or:\n",
    "\n",
    "```cypher\n",
    "MATCH (h:Token {pos : \"verb\", lemma : \"φημί\"})-[r:OBJ]->(d:Token {pos : \"noun\", case : \"accusative\", lemma : 'μῦθος'})\n",
    "```\n",
    "\n",
    "we need to implicitly translate this request into a query that retrieves all the *sentences* that have a node `h` governing a node `d` as specified in the queries above:\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Sentence)-[*]->(h:Token {pos : \"verb\", lemma : \"φημί\"})-[r:OBJ]->(d:Token {pos : \"noun\", case : \"accusative\", lemma : 'μῦθος'})\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "The first part, `(s:Sentence)-[*]->)`, will do the trick, as it asks for a `Sentence` node whose descendant (at any distance) is a node `h` governing a node `d`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Alternatively, the sentence each node belongs to is always retrievable from the property `address` of the node, so you can always reconstruct what the ID of the sentence is."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Editing the information in the DB"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Editing the node properties and the relations in the DB is quite possible with the extant technologies and (especially) with the OGM interface of py2neo. However, it is not exactly easy or quick...\n",
    "\n",
    "To give just one example, let us assume that in the current treebank in the sentence: `hi there, Mickey` the node `\",\"` is attached to `\"there\"` and the administrator of the gAGDT thinks it is incorrect, for it should go with `\"hi\"`. If we want to use cypher (or the OGM library) you actually have to write two queries: one to detach `\",\"` from `\"there\"`, one to attach it to `\"hi\"`. At the scale of 10, 20 or even more nodes in each sentence that becomes tedious soon enough (let alone, error-prone).\n",
    "\n",
    "There are, however, more complicated use cases..."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Split nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The AGDT contains a few errors of tokenization. For instance the tokenizer in the treebank editor fails to recognize that words written as κἀγὼ are actually made up by two tokens (καί and ἐγώ) and should be tokenized as: κἀ and γὼ or κ and ἀγὼ (that is debatable, but perhaps this second version is better).\\\\\n",
    "\n",
    "However, how can we make this correction in the DB? This apparently trivial operation translates into a list of non-trivial operation that must be performed. Let's consider one sentence in the XML format of the AGDT (Soph. *Aj.*, 24)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```xml\n",
    "<sentence id='11' subdoc='24' document_id='urn:cts:greekLit:tlg0011.tlg003.perseus-grc1'>\n",
    "    <word id='1' form='κἀγὼ' lemma='ἐγώ' postag='p-s---mn-' relation='SBJ' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='5'/>\n",
    "    <word id='2' form='̓' lemma='̓' postag='u--------' relation='AuxZ' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='3'/>\n",
    "    <word id='3' form='θελοντὴς' lemma='θελοντής' postag='n-s---mn-' relation='ATV' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='1'/>\n",
    "    <word id='4' form='τῷδ̓' lemma='ὅδε' postag='p-s---md-' relation='ATR' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='6'/>\n",
    "    <word id='5' form='ὑπεζύγην' lemma='ὑποζεύγνυμι' postag='v1saip---' relation='PRED' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='0'/>\n",
    "    <word id='6' form='πόνῳ' lemma='πόνος' postag='n-s---md-' relation='OBJ' cite='urn:cts:greekLit:tlg0011.tlg003:24' head='5'/>\n",
    "    <word id='7' form='.' lemma='.' postag='u--------' relation='AuxK' cite='' head='0'/>\n",
    "  </sentence>\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The word with ID 1 should be split in two tokens. In place of a word we need two. But that, in turns, means that the current word with `rank` = 2 (this is the property of the gAGDT where we register the linear order) becomes `rank` = 3 and so on.\n",
    "\n",
    "In the XML the `id` (our `rank`) is used to refer to the governing word in the `head` property. Nodes in the gAGDT have, at least for legacy reasons, a `head` property as well, that refers to the `rank` of the governing word. Strictly speaking, this is not needed in the gAGDT, because the dependency relation is otherwhise specified, but it may be handy (especially for format conversion) to have the head recorded as property of the nodes as well, as in the XML. That needs to be updated."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Possible solutions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What I think would be very practical is a system that receives a tabular or xml input and automatically updates the properties and relations of the node in the sentence. By creating the nodes that are missing, deleting the nodes that do not exist anymore and updating all the properties of the nodes that needs to be updated.\n",
    "\n",
    "Even better, the admins can have a graphical preview, where they can visualize their sentences before clicking on \"update\" to verify at a glance that they haven't done any mistake in the syntactical annotation."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  },
  "toc": {
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": "block",
   "toc_window_display": true
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
